{
  "success": true,
  "translations": {
    "hindi": [
      {
        "clause_id": 1,
        "translated_text": "कंपनी आपके लिए सॉफ्टवेयर बनाएगी जैसा कि संलग्न दस्तावेज़ में बताया गया है। उनके पास यह तय करने का पूरा अधिकार है कि वे काम किस तरह से करेंगे।"
      },
      {
        "clause_id": 2,
        "translated_text": "आपको बिल मिलने के 7 दिनों के भीतर कंपनी को 5,00,000 रुपये का भुगतान करना होगा। यदि आप भुगतान में देरी करते हैं, तो पूरी राशि चुकाने तक हर दिन 2% का ब्याज शुल्क लिया जाएगा।"
      },
      {
        "clause_id": 3,
        "translated_text": "यह अनुबंध एक वर्ष के लिए है। कंपनी बिना बताए किसी भी समय किसी भी कारण से इसे रद्द कर सकती है। यदि आप इसे रद्द करना चाहते हैं, तो आपको 3 महीने पहले सूचना देनी होगी और साल के बचे हुए समय की बकाया राशि का आधा हिस्सा देना होगा।"
      },
      {
        "clause_id": 4,
        "translated_text": "आपके लिए काम करते समय कंपनी जो कुछ भी बनाती या आविष्कार करती है, वह पूरी तरह से उनकी संपत्ति होगी, भले ही उन्होंने आपके संसाधनों का उपयोग किया हो या आपके कार्यालय में काम किया हो।"
      },
      {
        "clause_id": 5,
        "translated_text": "कंपनी किसी भी नुकसान या गलती के लिए आपको 1,000 रुपये से अधिक का भुगतान कभी नहीं करेगी। आप सहमत हैं कि भले ही वे लापरवाह हों या उनका व्यवहार गलत हो, आप उन पर मुकदमा नहीं करेंगे।"
      },
      {
        "clause_id": 6,
        "translated_text": "आपको कंपनी के रहस्यों को हमेशा के लिए गुप्त रखना होगा, लेकिन कंपनी को आपकी निजी जानकारी दूसरों के साथ साझा करने की अनुमति है।"
      },
      {
        "clause_id": 7,
        "translated_text": "आप कंपनी की कानूनी फीस और उनके द्वारा झेले गए किसी भी नुकसान की भरपाई करने के लिए सहमत हैं, भले ही वह समस्या कंपनी की अपनी गलती के कारण हुई हो।"
      },
      {
        "clause_id": 8,
        "translated_text": "यदि कोई कानूनी विवाद होता है, तो उसे कंपनी द्वारा चुनी गई जगह पर एक निजी मध्यस्थ के माध्यम से सुलझाया जाएगा। आप जूरी ट्रायल या सामूहिक मुकदमे में शामिल होने का अपना अधिकार छोड़ते हैं।"
      },
      {
        "clause_id": 9,
        "translated_text": "कंपनी जब चाहे बिना बताए इस अनुबंध की शर्तों को बदल सकती है। यदि आप उनकी सेवाओं का उपयोग जारी रखते हैं, तो इसका मतलब है कि आप नए नियमों को स्वीकार करते हैं।"
      },
      {
        "clause_id": 10,
        "translated_text": "आप इस अनुबंध के समाप्त होने के बाद दो साल तक किसी अन्य सॉफ्टवेयर कंपनी या डेवलपर को काम पर नहीं रखने के लिए सहमत हैं।"
      }
    ],
    "bengali": [
      {
        "clause_id": 1,
        "translated_text": "সংযুক্ত নথিতে বর্ণিত বর্ণনা অনুযায়ী কোম্পানি আপনার জন্য সফটওয়্যার তৈরি করবে। তারা কাজটি ঠিক কীভাবে করবে তা নির্ধারণ করার সম্পূর্ণ অধিকার তাদের রয়েছে।"
      },
      {
        "clause_id": 2,
        "translated_text": "বিল পাওয়ার ৭ দিনের মধ্যে আপনাকে কোম্পানিকে ৫,০০,০০০ টাকা পরিশোধ করতে হবে। আপনি যদি টাকা দিতে দেরি করেন, তবে পুরো টাকা শোধ না হওয়া পর্যন্ত প্রতিদিন ২% হারে জরিমানা বা সুদ দিতে হবে।"
      },
      {
        "clause_id": 3,
        "translated_text": "এই চুক্তির মেয়াদ এক বছর। কোম্পানি আপনাকে না জানিয়ে যেকোনো সময় যেকোনো কারণে এটি বাতিল করতে পারে। আপনি যদি বাতিল করতে চান, তবে আপনাকে ৩ মাস আগে নোটিশ দিতে হবে এবং বছরের বাকি সময়ের জন্য পাওনা টাকার অর্ধেক জরিমানা হিসেবে দিতে হবে।"
      },
      {
        "clause_id": 4,
        "translated_text": "আপনার জন্য কাজ করার সময় কোম্পানি যা কিছু তৈরি বা উদ্ভাবন করবে, তা সম্পূর্ণভাবে তাদের মালিকানাধীন হবে, এমনকি তারা যদি আপনার সরঞ্জাম ব্যবহার করে বা আপনার অফিসে কাজ করে থাকে তবুও।"
      },
      {
        "clause_id": 5,
        "translated_text": "যেকোনো ক্ষতি বা ভুলের জন্য কোম্পানি আপনাকে ১,০০০ টাকার বেশি কখনোই দেবে না। আপনি রাজি হচ্ছেন যে তারা যদি অসতর্ক হয় বা খারাপ আচরণও করে, তবুও আপনি তাদের বিরুদ্ধে কোনো আইনি ব্যবস্থা নেবেন না।"
      },
      {
        "clause_id": 6,
        "translated_text": "আপনাকে কোম্পানির গোপনীয় বিষয়গুলো চিরকাল গোপন রাখতে হবে, কিন্তু কোম্পানি আপনার ব্যক্তিগত তথ্য অন্যদের সাথে শেয়ার করার অধিকার রাখবে।"
      },
      {
        "clause_id": 7,
        "translated_text": "আপনি কোম্পানির আইনি খরচ এবং তাদের যেকোনো ক্ষতির টাকা দিতে রাজি হচ্ছেন, এমনকি যদি সমস্যাটি কোম্পানির নিজের ভুলের কারণেও হয়ে থাকে।"
      },
      {
        "clause_id": 8,
        "translated_text": "যদি কোনো আইনি বিরোধ দেখা দেয়, তবে কোম্পানি যে জায়গা বেছে নেবে সেখানে একজন ব্যক্তিগত সালিশকারীর মাধ্যমে তার সমাধান করা হবে। আপনি জুরি ট্রায়াল বা কোনো গণ-মামলায় যোগ দেওয়ার অধিকার ত্যাগ করছেন।"
      },
      {
        "clause_id": 9,
        "translated_text": "কোম্পানি আপনাকে না জানিয়ে যখন খুশি এই চুক্তির নিয়মাবলী পরিবর্তন করতে পারে। আপনি যদি তাদের পরিষেবা ব্যবহার চালিয়ে যান, তবে তার অর্থ হলো আপনি নতুন নিয়মগুলোতে রাজি আছেন।"
      },
      {
        "clause_id": 10,
        "translated_text": "এই চুক্তির মেয়াদ শেষ হওয়ার পর দুই বছর পর্যন্ত আপনি অন্য কোনো সফটওয়্যার কোম্পানি বা ডেভেলপার নিয়োগ না করতে রাজি হচ্ছেন।"
      }
    ]
  },
  "error": null
}